import random

IT = [['Go разработчик', '159 870 ₽'], ['Java разработчик', '156 740 ₽'], ['iOS разработчик', '141 930 ₽'],
      ['C# разработчик', '136 470 ₽'], ['Data scientist', '136 470 ₽'], ['Android разработчик', '135 690 ₽'],
      ['Python разработчик', '127 890 ₽'], ['C++ разработчик', '126 330 ₽'], ['.NET разработчик', '121 650 ₽'],
      ['PHP разработчик', '113 070 ₽'], ['Frontend разработчик', '99 820 ₽'], ['Менеджер IT проектов', '97 480 ₽'],
      ['Системный администратор', '74 080 ₽'], ['Специалист по ремонту техники', '72 520 ₽'],
      ['Специалист техподдержки', '68 620 ₽'], ['Тестировщик', '66 280 ₽']]
Education = [['Преподаватель ВУЗа', '110 210 ₽'], ['Преподаватель в колледже', '101 800 ₽'],
             ['Школьный учитель', '88 030 ₽'], ['Социолог', '71 740 ₽'], ['Логопед', '69 400 ₽'],
             ['Репетитор', '67 060 ₽'], ['Переводчик', '64 720 ₽'], ['Социальный педагог', '60 050 ₽'],
             ['Воспитатель детского сада', '48 350 ₽']]
Design = [['UX/UI дизайнер', '106 140 ₽'], ['Гейм-дизайнер', '106 050 ₽'], ['Дизайнер интерьера', '94 440 ₽'],
          ['3D-дизайнер', '88 200 ₽'], ['Веб-дизайнер', '85 170 ₽'], ['Дизайнер мебели', '84 480 ₽'],
          ['Дизайнер одежды', '83 610 ₽'], ['Иллюстратор', '82 750 ₽'], ['Графический дизайнер', '79 630 ₽'],
          ['Верстальщик', '78 850 ₽']]
Marketing = [['Маркетолог', '74 080 ₽'], ['Event-менеджер', '69 400 ₽'], ['PR-менеджер', '68 620 ₽'],
             ['Директолог', '68 620 ₽'], ['SMM-специалист', '58 490 ₽'], ['SEO-специалист', '56 150 ₽'],
             ['Копирайтер', '53 810 ₽'], ['Контент-менеджер', '48 350 ₽'], ['Таргетолог', '47 570 ₽']]
Accounting = [['Трейдер', '138 810 ₽'], ['Аудитор', '102 930 ₽'], ['Главный бухгалтер', '99 820 ₽'],
              ['Менеджер по кредитованию', '95 140 ₽'], ['Финансовый аналитик', '85 000 ₽'], ['Бухгалтер', '76 420 ₽'],
              ['Специалист по бюджетированию', '76 420 ₽'], ['Специалист по ВЭД', '72 520 ₽'],
              ['Экономист', '71 740 ₽']]
Office = [['Директор по персоналу', '120 100 ₽'], ['Помощник руководителя', '72 520 ₽'], ['HR-специалист', '69 400 ₽'],
          ['Менеджер по закупкам', '67 840 ₽'], ['Заведующий хозяйством', '60 830 ₽'],
          ['Делопроизводитель', '56 150 ₽'], ['Начальник склада', '53 810 ₽'], ['Секретарь', '50 690 ₽']]
Jurisprudence = [['Судья', '465 870 ₽'], ['Нотариус', '216 820 ₽'], ['Риэлтор', '121 650 ₽'],
                 ['Юрист по банкротству', '91 240 ₽'], ['Юрист', '90 460 ₽'], ['Налоговый юрист', '79 540 ₽'],
                 ['Адвокат', '76 420 ₽'], ['Помощник нотариуса', '59 270 ₽']]
Medicine = [['Главный врач', '150 500 ₽'], ['Заведующий отделением', '113 070 ₽'], ['Стоматолог', '97 480 ₽'],
            ['Хирург', '96 700 ₽'], ['Ортодонт', '93 580 ₽'], ['Эндокринолог', '88 900 ₽'], ['Уролог', '88 900 ₽'],
            ['Травматолог', '88 120 ₽'], ['Невролог', '87 340 ₽'], ['Офтальмолог', '85 780 ₽'],
            ['Терапевт', '85 000 ₽'], ['Дерматовенеролог', '81 880 ₽'], ['Педиатр', '80 320 ₽'],
            ['Диетолог', '78 760 ₽'], ['Психиатр', '76 420 ₽'], ['Психолог', '67 060 ₽'], ['Медсестра', '67 060 ₽'],
            ['Фармацевт', '66 280 ₽'], ['Санитар', '59 270 ₽'], ['Лаборант', '55 370 ₽'], ['Фельдшер', '52 250 ₽']]
Trading = [['Менеджер по продажам', '94 360 ₽'], ['Директор магазина', '85 780 ₽'],
           ['Продавец автомобилей', '82 660 ₽'], ['Товаровед', '68 620 ₽'], ['Торговый представитель', '64 720 ₽'],
           ['Кассир', '61 610 ₽'], ['Супервайзер', '60 050 ₽'], ['Продавец', '51 470 ₽'], ['Мерчендайзер', '43 670 ₽']]
Beauty = [['Массажист', '92 020 ₽'], ['Фитнес-тренер', '92 020 ₽'], ['Барбер', '90 460 ₽'], ['Косметолог', '81 880 ₽'],
          ['Стилист', '64 720 ₽'], ['Парикмахер', '57 710 ₽'], ['Мастер маникюра', '46 790 ₽']]
Production = [['Инженер по эксплуатации', '102 930 ₽'], ['Главный инженер', '96 700 ₽'],
              ['Инженер-конструктор', '95 920 ₽'], ['Инженер по качеству', '91 240 ₽'], ['Инженер АСУ', '88 120 ₽'],
              ['Инженер-эколог', '87 340 ₽'], ['Начальник цеха', '84 220 ₽'], ['Токарь', '70 960 ₽'],
              ['Наладчик станков с ЧПУ', '70 180 ₽'], ['Сборщик мебели', '66 280 ₽'], ['Оператор станка', '63 170 ₽'],
              ['Инженер-химик', '62 390 ₽'], ['Технолог пищевого производства', '62 390 ₽'], ['Слесарь', '60 050 ₽'],
              ['Сборщик электроники', '55 370 ₽'], ['Швея', '55 370 ₽']]
Transport = [['Директор по логистике', '99 820 ₽'], ['Инженер по обслуживанию', '89 680 ₽'],
             ['Водитель', '68 620 ₽'], ['Водитель такси', '67 840 ₽'], ['Автомеханик', '61 610 ₽'],
             ['Логист', '58 490 ₽'], ['Оператор-упаковщик', '53 030 ₽'], ['Кладовщик', '50 690 ₽'],
             ['Комплектовщик', '48 350 ₽'], ['Автомойщик', '42 890 ₽'], ['Курьер', '40 550 ₽']]
Construction = [['Архитектор', '131 010 ₽'], ['Прораб', '98 260 ₽'], ['Инженер-технолог', '96 700 ₽'],
                ['Газосварщик', '90 460 ₽'], ['Инженер-проектировщик', '87 340 ₽'],
                ['Геодезист', '85 000 ₽'], ['Сметчик', '81 100 ₽'], ['Сварщик', '75 640 ₽'], ['Плиточник', '75 640 ₽'],
                ['Сантехник', '72 520 ₽'], ['Инженер-энергетик', '71 740 ₽'], ['Арматурщик', '70 180 ₽'],
                ['Бригадир', '67 840 ₽'], ['Бетонщик', '65 500 ₽'], ['Фрезеровщик', '65 500 ₽'],
                ['Крановщик', '63 950 ₽'], ['Электромонтажник', '63 950 ₽'], ['Электрик', '63 170 ₽'],
                ['Кровельщик', '60 830 ₽'], ['Маляр', '56 930 ₽'], ['Монтажник', '56 930 ₽'], ['Каменщик', '53 810 ₽'],
                ['Штукатур', '53 810 ₽'], ['Плотник', '53 030 ₽']]
Safety = [['Полковник полиции', '196 730 ₽'], ['Майор полиции', '132 020 ₽'],
          ['Лейтенант, прапорщик полиции', '93 140 ₽'], ['Спасатель, пожарный', '85 780 ₽'],
          ['Инженер по охране труда', '81 880 ₽'], ['Рядовой, старшина полиции', '74 100 ₽'], ['Охранник', '67 060 ₽']]
Agricultural_industry = [['Зоотехник', '72 520 ₽'], ['Агроном', '67 840 ₽'], ['Тракторист', '63 170 ₽'],
                         ['Механизатор', '56 930 ₽']]
Handyman = [['Фасовщик', '61 610 ₽'], ['Горничная', '56 930 ₽'], ['Оператор call-центра', '53 810 ₽'],
            ['Маркировщик', '53 030 ₽'], ['Грузчик', '52 250 ₽'], ['Социальный работник', '50 690 ₽'],
            ['Разнорабочий', '49 910 ₽'], ['Сиделка', '48 350 ₽'], ['Почтальон', '44 450 ₽'], ['Заправщик', '42 890 ₽'],
            ['Уборщик(-ца)', '38 210 ₽']]
Food = [['Шеф-повар', '92 800 ₽'], ['Повар', '68 620 ₽'], ['Официант', '59 270 ₽'], ['Бариста', '57 710 ₽'],
        ['Бармен', '56 930 ₽'], ['Кондитер', '53 030 ₽']]
Sphere = [Trading, Medicine, Transport, IT, Office, Production, Accounting, Construction, Handyman, Marketing, Food,
          Design, Education, Jurisprudence, Beauty, Safety, Agricultural_industry]
Probably_of_sphere = [0.17105527, 0.27030064, 0.36791032, 0.4629912, 0.5422269, 0.61752895, 0.69047279, 0.76077739,
                      0.80938649, 0.85259686, 0.88473871, 0.91080943, 0.93570603, 0.95874613, 0.97706989, 0.99202192,
                      0.99999968]


def generation_profession(cnt):
    massiv_profession = []
    for i in range(cnt):
        q = random.random()
        for j in range(18):
            if (Probably_of_sphere[j] > q):
                s = random.randint(0, len(Sphere[j]) - 1)
                profession = Sphere[j][s]
                break
        massiv_profession.append(profession)
    return massiv_profession


# Обезличивание
def obez_pro_inc(Professions_income):
    Obez_professions_income = []
    for x in range(len(Professions_income)):
        a = []

        if Professions_income[x] in IT:
            a.append('IT')
        if Professions_income[x] in Education:
            a.append('Образование')
        if Professions_income[x] in Marketing:
            a.append('Маркетинг')
        if Professions_income[x] in Design:
            a.append('Дизайн')
        if Professions_income[x] in Accounting:
            a.append('Бухгалтерия')
        if Professions_income[x] in Office:
            a.append('Офис')
        if Professions_income[x] in Jurisprudence:
            a.append('Юриспруденция')
        if Professions_income[x] in Medicine:
            a.append('Медицина')
        if Professions_income[x] in Trading:
            a.append('Торговля')
        if Professions_income[x] in Beauty:
            a.append('Красота')
        if Professions_income[x] in Production:
            a.append('Производство')
        if Professions_income[x] in Transport:
            a.append('Транспорт')
        if Professions_income[x] in Construction:
            a.append('Строительство')
        if Professions_income[x] in Safety:
            a.append('Безопасность')
        if Professions_income[x] in Agricultural_industry:
            a.append('Сельское хозяйство')
        if Professions_income[x] in Handyman:
            a.append('Разнорабочий')
        if Professions_income[x] in Food:
            a.append('Питание')

        procent = random.uniform(0.85, 1.15)
        zp = Professions_income[x][1].replace(' ', '')
        zp = zp.replace('₽', '')
        zp = str(int(int(zp) * procent)) + ' ₽'
        a.append(zp)

        Obez_professions_income.append(a)
    return (Obez_professions_income)
