import random

IT = [['Go разработчик', '115 920 ₽'], ['Java разработчик', '113 650 ₽'], ['iOS разработчик', '102 910 ₽'],
      ['C# разработчик', '98 950 ₽'], ['Data scientist', '98 950 ₽'], ['Android разработчик', '98 390 ₽'],
      ['Python разработчик', '92 730 ₽'], ['C++ разработчик', '91 600 ₽'], ['.NET разработчик', '88 210 ₽'],
      ['PHP разработчик', '81 990 ₽'], ['Frontend разработчик', '72 380 ₽'], ['Менеджер IT проектов', '70 680 ₽'],
      ['Системный администратор', '53 720 ₽'], ['Специалист по ремонту техники', '52 590 ₽'],
      ['Специалист техподдержки', '49 760 ₽'], ['Тестировщик', '48 060 ₽']]
Education = [['Преподаватель ВУЗа', '79 910 ₽'], ['Преподаватель в колледже', '73 810 ₽'],
             ['Школьный учитель', '63 830 ₽'], ['Социолог', '52 020 ₽'], ['Логопед', '50 320 ₽'],
             ['Репетитор', '48 630 ₽'], ['Переводчик', '46 930 ₽'], ['Социальный педагог', '43 540 ₽'],
             ['Воспитатель детского сада', '35 060 ₽']]
Marketing = [['Маркетолог', '53 720 ₽'], ['Event-менеджер', '50 320 ₽'], ['PR-менеджер', '49 760 ₽'],
             ['Директолог', '49 760 ₽'], ['SMM-специалист', '42 410 ₽'], ['SEO-специалист', '40 710 ₽'],
             ['Копирайтер', '39 020 ₽'], ['Контент-менеджер', '35 060 ₽'], ['Таргетолог', '34 490 ₽']]
Beauty = [['Массажист', '66 720 ₽'], ['Фитнес-тренер', '66 720 ₽'], ['Барбер', '65 590 ₽'], ['Косметолог', '59 370 ₽'],
          ['Стилист', '46 930 ₽'], ['Парикмахер', '41 840 ₽'], ['Мастер маникюра', '33 930 ₽']]
Production = [['Инженер по эксплуатации', '74 640 ₽'], ['Главный инженер', '70 110 ₽'],
              ['Инженер-конструктор', '69 550 ₽'], ['Инженер по качеству', '66 160 ₽'], ['Инженер АСУ', '63 900 ₽'],
              ['Инженер-эколог', '63 330 ₽'], ['Начальник цеха', '61 070 ₽'], ['Токарь', '51 460 ₽'],
              ['Наладчик станков с ЧПУ', '50 890 ₽'], ['Сборщик мебели', '48 060 ₽'], ['Оператор станка', '45 800 ₽'],
              ['Инженер-химик', '45 240 ₽'], ['Технолог пищевого производства', '45 240 ₽'], ['Слесарь', '43 540 ₽'],
              ['Сборщик электроники', '40 150 ₽'], ['Швея', '40 150 ₽']]
Design = [['UX/UI дизайнер', '76 960 ₽'], ['Гейм-дизайнер', '76 900 ₽'], ['Дизайнер интерьера', '68 480 ₽'],
          ['3D-дизайнер', '63 960 ₽'], ['Веб-дизайнер', '61 760 ₽'], ['Дизайнер мебели', '61 250 ₽'],
          ['Дизайнер одежды', '60 630 ₽'], ['Иллюстратор', '60 000 ₽'], ['Графический дизайнер', '57 740 ₽'],
          ['Верстальщик', '57 170 ₽']]
Accounting = [['Трейдер', '100 650 ₽'], ['Аудитор', '74 640 ₽'], ['Главный бухгалтер', '72 380 ₽'],
              ['Менеджер по кредитованию', '68 980 ₽'], ['Финансовый аналитик', '61 630 ₽'], ['Бухгалтер', '55 410 ₽'],
              ['Специалист по бюджетированию', '55 410 ₽'], ['Специалист по ВЭД', '52 590 ₽'],
              ['Экономист', '52 020 ₽']]
Office = [['Директор по персоналу', '87 080 ₽'], ['Помощник руководителя', '52 590 ₽'], ['HR-специалист', '50 320 ₽'],
          ['Менеджер по закупкам', '49 190 ₽'], ['Заведующий хозяйством', '44 100 ₽'],
          ['Делопроизводитель', '40 710 ₽'], ['Начальник склада', '39 020 ₽'], ['Секретарь', '36 750 ₽']]
Jurisprudence = [['Судья', '337 800 ₽'], ['Нотариус', '157 210 ₽'], ['Риэлтор', '88 210 ₽'],
                 ['Юрист по банкротству', '66 160 ₽'], ['Юрист', '65 590 ₽'], ['Налоговый юрист', '57 670 ₽'],
                 ['Адвокат', '55 410 ₽'], ['Помощник нотариуса', '42 970 ₽']]
Medicine = [['Главный врач', '109 130 ₽'], ['Заведующий отделением', '81 990 ₽'], ['Стоматолог', '70 680 ₽'],
            ['Хирург', '70 110 ₽'], ['Ортодонт', '67 850 ₽'], ['Эндокринолог', '64 460 ₽'], ['Уролог', '64 460 ₽'],
            ['Травматолог', '63 900 ₽'], ['Невролог', '63 330 ₽'], ['Офтальмолог', '62 200 ₽'],
            ['Терапевт', '61 630 ₽'], ['Дерматовенеролог', '59 370 ₽'], ['Педиатр', '58 240 ₽'],
            ['Диетолог', '57 110 ₽'], ['Психиатр', '55 410 ₽'], ['Психолог', '48 630 ₽'], ['Медсестра', '48 630 ₽'],
            ['Фармацевт', '48 060 ₽'], ['Санитар', '42 970 ₽'], ['Лаборант', '40 150 ₽'], ['Фельдшер', '37 880 ₽']]
Trading = [['Менеджер по продажам', '68 420 ₽'], ['Директор магазина', '62 200 ₽'],
           ['Продавец автомобилей', '59 940 ₽'], ['Товаровед', '49 760 ₽'], ['Торговый представитель', '46 930 ₽'],
           ['Кассир', '44 670 ₽'], ['Супервайзер', '43 540 ₽'], ['Продавец', '37 320 ₽'], ['Мерчендайзер', '31 670 ₽']]
Transport = [['Директор по логистике', '72 380 ₽'], ['Инженер по обслуживанию', '65 030 ₽'], ['Водитель', '49 760 ₽'],
             ['Водитель такси', '49 190 ₽'], ['Автомеханик', '44 670 ₽'], ['Логист', '42 410 ₽'],
             ['Оператор-упаковщик', '38 450 ₽'], ['Кладовщик', '36 750 ₽'], ['Комплектовщик', '35 060 ₽'],
             ['Автомойщик', '31 100 ₽'], ['Курьер', '29 400 ₽']]
Construction = [['Архитектор', '95 000 ₽'], ['Прораб', '71 240 ₽'], ['Инженер-технолог', '70 110 ₽'],
                ['Газосварщик', '65 590 ₽'], ['Инженер-проектировщик', '63 330 ₽'], ['Геодезист', '61 630 ₽'],
                ['Сметчик', '58 810 ₽'], ['Сварщик', '54 850 ₽'], ['Плиточник', '54 850 ₽'], ['Сантехник', '52 590 ₽'],
                ['Инженер-энергетик', '52 020 ₽'], ['Арматурщик', '50 890 ₽'], ['Бригадир', '49 190 ₽'],
                ['Бетонщик', '47 500 ₽'], ['Фрезеровщик', '47 500 ₽'], ['Крановщик', '46 370 ₽'],
                ['Электромонтажник', '46 370 ₽'], ['Электрик', '45 800 ₽'], ['Кровельщик', '44 100 ₽'],
                ['Маляр', '41 280 ₽'], ['Монтажник', '41 280 ₽'], ['Каменщик', '39 020 ₽'], ['Штукатур', '39 020 ₽'],
                ['Плотник', '38 450 ₽']]
Safety = [['Полковник полиции', '142 650 ₽'], ['Майор полиции', '95 720 ₽'],
          ['Лейтенант, прапорщик полиции', '67 540 ₽'], ['Спасатель, пожарный', '62 200 ₽'],
          ['Инженер по охране труда', '59 370 ₽'], ['Рядовой, старшина полиции', '53 730 ₽'], ['Охранник', '48 630 ₽']]
Agricultural_industry = [['Зоотехник', '52 590 ₽'], ['Агроном', '49 190 ₽'], ['Тракторист', '45 800 ₽'],
                         ['Механизатор', '41 280 ₽']]
Handyman = [['Фасовщик', '44 670 ₽'], ['Горничная', '41 280 ₽'], ['Оператор call-центра', '39 020 ₽'],
            ['Маркировщик', '38 450 ₽'], ['Грузчик', '37 880 ₽'], ['Социальный работник', '36 750 ₽'],
            ['Разнорабочий', '36 190 ₽'], ['Сиделка', '35 060 ₽'], ['Почтальон', '32 230 ₽'], ['Заправщик', '31 100 ₽'],
            ['Уборщик(-ца)', '27 710 ₽']]
Food = [['Шеф-повар', '67 290 ₽'], ['Повар', '49 760 ₽'], ['Официант', '42 970 ₽'], ['Бариста', '41 840 ₽'],
        ['Бармен', '41 280 ₽'], ['Кондитер', '38 450 ₽']]
Probably_of_sphere = [0.17111676, 0.27039626, 0.36798049, 0.46302181, 0.54227588, 0.61760963, 0.69050563, 0.76085951,
                      0.80949269, 0.85272218, 0.88482643, 0.91089127, 0.93579061, 0.95878276, 0.97711291, 0.99205251, 1]
Sphere = [Trading, Medicine, Transport, IT, Office, Production, Accounting, Construction, Handyman, Marketing, Food,
          Design, Education, Jurisprudence, Beauty, Safety, Agricultural_industry]


def generation_profession(cnt):
    massiv_profession = []
    for i in range(cnt):
        q = random.random()
        for j in range(18):
            if Probably_of_sphere[j] > q:
                s = random.randint(0, len(Sphere[j]) - 1)
                profession = Sphere[j][s]
                break
        massiv_profession.append(profession)
    return massiv_profession


# Обезличивание
def obez_pro_inc(Professions_income):
    Obez_professions_income = []
    for x in range(len(Professions_income)):
        a = []

        if Professions_income[x] in IT:
            a.append('IT')
        if Professions_income[x] in Education:
            a.append('Образование')
        if Professions_income[x] in Marketing:
            a.append('Маркетинг')
        if Professions_income[x] in Design:
            a.append('Дизайн')
        if Professions_income[x] in Accounting:
            a.append('Бухгалтерия')
        if Professions_income[x] in Office:
            a.append('Офис')
        if Professions_income[x] in Jurisprudence:
            a.append('Юриспруденция')
        if Professions_income[x] in Medicine:
            a.append('Медицина')
        if Professions_income[x] in Trading:
            a.append('Торговля')
        if Professions_income[x] in Beauty:
            a.append('Красота')
        if Professions_income[x] in Production:
            a.append('Производство')
        if Professions_income[x] in Transport:
            a.append('Транспорт')
        if Professions_income[x] in Construction:
            a.append('Строительство')
        if Professions_income[x] in Safety:
            a.append('Безопасность')
        if Professions_income[x] in Agricultural_industry:
            a.append('Сельское хозяйство')
        if Professions_income[x] in Handyman:
            a.append('Разнорабочий')
        if Professions_income[x] in Food:
            a.append('Питание')

        procent = random.uniform(0.85, 1.15)
        zp = Professions_income[x][1].replace(' ', '')
        zp = zp.replace('₽', '')
        zp = str(int(int(zp) * procent)) + ' ₽'
        a.append(zp)

        Obez_professions_income.append(a)
    return (Obez_professions_income)
