"""
[(x, [a,b]),...]

x - упорядоченная вероятность сложенная с предидущими элементами,
[a, b] - возрастной отрезок, которому соответсвует вероятность

Пример
Пусть вероятности цвета шарика при доставании такие

0.5 - синий
0.25- зеленый
0.2 - зеленый
0.05 - черный

Тогда массив будет
[(0.5, ["синий"]), (0.75,["зеленый"]), (0.95, ["красный"]), (1,["черный"])]

Выберем случайное число 0.654
 0.5 < 0.654 < 0.75
Тогда шарик зеленый

Если число 0.1, то шарик синий
"""
age_probability_distributions_st_petersburg = [(11.5, [70, 108]), (20.9, [35, 39]), (29.2, [39, 44]), (36.9, [29, 34]),
                                               (44.2, [44, 49]), (51.1, [59, 64]),
                                               (57.9, [49, 54]), (64.2, [54, 59]), (70.2, [64, 69]), (76.1, [7, 13]),
                                               (82, [19, 24]), (87.5, [0, 5]),
                                               (92.5, [24, 29]), (94.6, [17, 19]), (96.2, [13, 15]), (97.8, [15, 17]),
                                               (98.9, [6, 6]), (100, [7, 13])]
